---
title: AddInId
classe: Autodesk.Revit.DB.AddInId
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# AddInId

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `addInId.IsValidObject` | Boolean |
| `Void Dispose()` | `addInId.Dispose()` | Void |
| `String GetAddInName()` | `addInId.GetAddInName()` | String |
| `String GetAddInNameFromDocument(Document)` | `addInId.GetAddInNameFromDocument(aDoc)` | String |
| `Guid GetGUID()` | `addInId.GetGUID()` | Guid |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```